STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_Security_Central/STM32_BLE/App/app_ble.c
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
/**
 * @brief Handle the action for Button 1 press.
 *
 * If the device is not connected as a BLE client, it starts the scan procedure.
 * If the device is connected as a BLE client, it sets the task to start the procedure
 * for writing the peripheral characteristic.
 *
 * @note This function is specific to TASK_BUTTON_1.
 */
void APPE_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    /* Call the function to start the scan procedure */
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
  }
  else
  {
    /* Set the task to start the procedure for writing the peripheral characteristic */
    UTIL_SEQ_SetTask( 1u << CFG_TASK_WRITE_CHAR_ID, CFG_SEQ_PRIO_0);
  }

  return;
}

/**
 * @brief Handle the action for Button 2 press.
 *
 * If the device is not connected as a BLE client, it attempts to clear the security
 * database.
 *
 * @note This function is specific to TASK_BUTTON_2.
 */
void APPE_Button2Action(void)
{  
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  
  return;
}

/**
 * @brief Handle the action for Button 3 press.
 *
 * If the device is connected as a BLE client, it initiates the procedure to terminate
 * the connection.
 *
 * @note This function is specific to TASK_BUTTON_3.
 */
void APPE_Button3Action(void)
{  
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT)
  {
    APP_BLE_Procedure_Gap_General(PROC_GAP_GEN_CONN_TERMINATE);
  }
  
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
